adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21E17L.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="27" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="28" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="29" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="30" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="21" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="32" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="1.2.2">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="13" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="14" caption="DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="15" caption="DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="16" caption="DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="17" caption="DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="(@_DITHERING*16+@_PG*8+@_SWAP*4+@_DTI*2+@_OTMX*1)"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="18" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="19" caption="DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="20" caption="DMA Match/Compare 1 trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="24" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER" value="1"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
