adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21E17L.atdf
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMD21E1xL" caption="SAMD21E1xL">
      <pin position="1" pad="PA02"/>
      <pin position="2" pad="PA03"/>
      <pin position="3" pad="PB04"/>
      <pin position="4" pad="PB05"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="PA05"/>
      <pin position="7" pad="PA06"/>
      <pin position="8" pad="PA07"/>
      <pin position="9" pad="VDDANA"/>
      <pin position="10" pad="GNDIO"/>
      <pin position="11" pad="PA08"/>
      <pin position="12" pad="PA09"/>
      <pin position="13" pad="PA10"/>
      <pin position="14" pad="PA11"/>
      <pin position="15" pad="PA14"/>
      <pin position="16" pad="PA15"/>
      <pin position="17" pad="PA16"/>
      <pin position="18" pad="PA17"/>
      <pin position="19" pad="PA18"/>
      <pin position="20" pad="PA19"/>
      <pin position="21" pad="PA22"/>
      <pin position="22" pad="PA23"/>
      <pin position="23" pad="PA24"/>
      <pin position="24" pad="PA25"/>
      <pin position="25" pad="RESET_N"/>
      <pin position="26" pad="GNDIO"/>
      <pin position="27" pad="VDDCORE"/>
      <pin position="28" pad="VDDIN"/>
      <pin position="29" pad="PA30"/>
      <pin position="30" pad="PA31"/>
      <pin position="31" pad="PB02"/>
      <pin position="32" pad="PB03"/>
    </pinout>
    <pinout name="SAMD21E1xLS" caption="SAMD21E1xLS">
      <pin position="1" pad="PA30"/>
      <pin position="2" pad="PA31"/>
      <pin position="3" pad="PB02"/>
      <pin position="4" pad="PB03"/>
      <pin position="5" pad="PA02"/>
      <pin position="6" pad="PA03"/>
      <pin position="7" pad="PB04"/>
      <pin position="8" pad="PB05"/>
      <pin position="9" pad="PA04"/>
      <pin position="10" pad="PA05"/>
      <pin position="11" pad="PA06"/>
      <pin position="12" pad="PA07"/>
      <pin position="13" pad="VDDANA"/>
      <pin position="14" pad="GNDIO"/>
      <pin position="15" pad="PA08"/>
      <pin position="16" pad="PA09"/>
      <pin position="17" pad="PA10"/>
      <pin position="18" pad="PA11"/>
      <pin position="19" pad="PA14"/>
      <pin position="20" pad="PA15"/>
      <pin position="21" pad="PA16"/>
      <pin position="22" pad="PA17"/>
      <pin position="23" pad="PA18"/>
      <pin position="24" pad="PA19"/>
      <pin position="25" pad="PA22"/>
      <pin position="26" pad="PA23"/>
      <pin position="27" pad="PA24"/>
      <pin position="28" pad="PA25"/>
      <pin position="29" pad="RESET_N"/>
      <pin position="30" pad="GNDIO"/>
      <pin position="31" pad="VDDCORE"/>
      <pin position="32" pad="VDDIN"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>